espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/icm20689/inc/sl_icm20689_defs.h
#ifndef SL_ICM20689_DEFS_H
#define SL_ICM20689_DEFS_H

#ifdef __cplusplus
extern "C" {
#endif

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

/* SELF_TEST_X_GYRO bit fields*/
#define ICM20689_REG_SELF_TEST_X_GYRO (0X00)

#define ICM20689_SELF_TEST_X_GYRO_SHIFT_XG_ST_DATA (0X00)

#define ICM20689_SELF_TEST_X_GYRO_MASK_XG_ST_DATA (0XFF)

/* SELF_TEST_Y_GYRO bit fields*/
#define ICM20689_REG_SELF_TEST_Y_GYRO (0X01)

#define ICM20689_SELF_TEST_Y_GYRO_SHIFT_YG_ST_DATA (0X00)

#define ICM20689_SELF_TEST_Y_GYRO_MASK_YG_ST_DATA (0XFF)

/* SELF_TEST_Z_GYRO bit fields*/
#define ICM20689_REG_SELF_TEST_Z_GYRO (0X02)

#define ICM20689_SELF_TEST_Z_GYRO_SHIFT_ZG_ST_DATA (0X00)

#define ICM20689_SELF_TEST_Z_GYRO_MASK_ZG_ST_DATA (0XFF)

/* SELF_TEST_X_ACCEL bit fields*/
#define ICM20689_REG_SELF_TEST_X_ACCEL (0X0D)

#define ICM20689_SELF_TEST_X_ACCEL_SHIFT_XA_ST_DATA (0X00)

#define ICM20689_SELF_TEST_X_ACCEL_MASK_XA_ST_DATA (0XFF)

/* SELF_TEST_Y_ACCEL bit fields*/
#define ICM20689_REG_SELF_TEST_Y_ACCEL (0X0E)

#define ICM20689_SELF_TEST_Y_ACCEL_SHIFT_YA_ST_DATA (0X00)

#define ICM20689_SELF_TEST_Y_ACCEL_MASK_YA_ST_DATA (0XFF)

/* SELF_TEST_Z_ACCEL bit fields*/
#define ICM20689_REG_SELF_TEST_Z_ACCEL (0X0F)

#define ICM20689_SELF_TEST_Z_ACCEL_SHIFT_ZA_ST_DATA (0X00)

#define ICM20689_SELF_TEST_Z_ACCEL_MASK_ZA_ST_DATA (0XFF)

/* XG_OFFS_USRH bit fields*/
#define ICM20689_REG_XG_OFFS_USRH (0X13)

#define ICM20689_XG_OFFS_USRH_SHIFT_X_OFFS_USR (0X00)

#define ICM20689_XG_OFFS_USRH_MASK_X_OFFS_USR (0XFF)

/* XG_OFFS_USRL bit fields*/
#define ICM20689_REG_XG_OFFS_USRL (0X14)

#define ICM20689_XG_OFFS_USRL_SHIFT_X_OFFS_USR (0X00)

#define ICM20689_XG_OFFS_USRL_MASK_X_OFFS_USR (0XFF)

/* YG_OFFS_USRH bit fields*/
#define ICM20689_REG_YG_OFFS_USRH (0X15)

#define ICM20689_YG_OFFS_USRH_SHIFT_Y_OFFS_USR (0X00)

#define ICM20689_YG_OFFS_USRH_MASK_Y_OFFS_USR (0XFF)

/* YG_OFFS_USRL bit fields*/
#define ICM20689_REG_YG_OFFS_USRL (0X16)

#define ICM20689_YG_OFFS_USRL_SHIFT_Y_OFFS_USR (0X00)

#define ICM20689_YG_OFFS_USRL_MASK_Y_OFFS_USR (0XFF)

/* ZG_OFFS_USRH bit fields*/
#define ICM20689_REG_ZG_OFFS_USRH (0X17)

#define ICM20689_ZG_OFFS_USRH_SHIFT_Z_OFFS_USR (0X00)

#define ICM20689_ZG_OFFS_USRH_MASK_Z_OFFS_USR (0XFF)

/* ZG_OFFS_USRL bit fields*/
#define ICM20689_REG_ZG_OFFS_USRL (0X18)

#define ICM20689_ZG_OFFS_USRL_SHIFT_Z_OFFS_USR (0X00)

#define ICM20689_ZG_OFFS_USRL_MASK_Z_OFFS_USR (0XFF)

/* SMPLRT_DIV bit fields*/
#define ICM20689_REG_SMPLRT_DIV (0X19)

#define ICM20689_SMPLRT_DIV_SHIFT_SMPLRT_DIV (0X00)

#define ICM20689_SMPLRT_DIV_MASK_SMPLRT_DIV (0XFF)

/* CONFIG bit fields*/
#define ICM20689_REG_CONFIG (0X1A)

#define ICM20689_CONFIG_SHIFT_DLPF_CFG (0X00)
#define ICM20689_CONFIG_SHIFT_EXT_SYNC_SET (0X03)
#define ICM20689_CONFIG_SHIFT_FIFO_MODE (0X06)

#define ICM20689_CONFIG_MASK_DLPF_CFG (0X07)
#define ICM20689_CONFIG_MASK_EXT_SYNC_SET (0X38)
#define ICM20689_CONFIG_MASK_FIFO_MODE (0X40)

#define ICM20689_CONFIG_BIT_FIFO_MODE (0X40)

#define _ICM20689_CONFIG_DLPF_CFG_250HZ (0X00)
#define _ICM20689_CONFIG_DLPF_CFG_176HZ (0X01)
#define _ICM20689_CONFIG_DLPF_CFG_92HZ (0X02)
#define _ICM20689_CONFIG_DLPF_CFG_41HZ (0X03)
#define _ICM20689_CONFIG_DLPF_CFG_20HZ (0X04)
#define _ICM20689_CONFIG_DLPF_CFG_10HZ (0X05)
#define _ICM20689_CONFIG_DLPF_CFG_5HZ (0X06)
#define _ICM20689_CONFIG_DLPF_CFG_3281HZ (0X07)
#define ICM20689_CONFIG_DLPF_CFG_250HZ (0X00 << ICM20689_CONFIG_SHIFT_DLPF_CFG)
#define ICM20689_CONFIG_DLPF_CFG_176HZ (0X01 << ICM20689_CONFIG_SHIFT_DLPF_CFG)
#define ICM20689_CONFIG_DLPF_CFG_92HZ (0X02 << ICM20689_CONFIG_SHIFT_DLPF_CFG)
#define ICM20689_CONFIG_DLPF_CFG_41HZ (0X03 << ICM20689_CONFIG_SHIFT_DLPF_CFG)
#define ICM20689_CONFIG_DLPF_CFG_20HZ (0X04 << ICM20689_CONFIG_SHIFT_DLPF_CFG)
#define ICM20689_CONFIG_DLPF_CFG_10HZ (0X05 << ICM20689_CONFIG_SHIFT_DLPF_CFG)
#define ICM20689_CONFIG_DLPF_CFG_5HZ (0X06 << ICM20689_CONFIG_SHIFT_DLPF_CFG)
#define ICM20689_CONFIG_DLPF_CFG_3281HZ (0X07 << ICM20689_CONFIG_SHIFT_DLPF_CFG)

#define _ICM20689_CONFIG_EXT_SYNC_SET_DISABLED (0X00)
#define _ICM20689_CONFIG_EXT_SYNC_SET_TEMP_OUT_L0 (0X01)
#define _ICM20689_CONFIG_EXT_SYNC_SET_GYRO_XOUT_L0 (0X02)
#define _ICM20689_CONFIG_EXT_SYNC_SET_GYRO_YOUT_L0 (0X03)
#define _ICM20689_CONFIG_EXT_SYNC_SET_GYRO_ZOUT_L0 (0X04)
#define _ICM20689_CONFIG_EXT_SYNC_SET_ACCEL_XOUT_L0 (0X05)
#define _ICM20689_CONFIG_EXT_SYNC_SET_ACCEL_YOUT_L0 (0X06)
#define _ICM20689_CONFIG_EXT_SYNC_SET_ACCEL_ZOUT_L0 (0X07)
#define ICM20689_CONFIG_EXT_SYNC_SET_DISABLED (0X00 << ICM20689_CONFIG_SHIFT_EXT_SYNC_SET)
#define ICM20689_CONFIG_EXT_SYNC_SET_TEMP_OUT_L0 (0X01 << ICM20689_CONFIG_SHIFT_EXT_SYNC_SET)
#define ICM20689_CONFIG_EXT_SYNC_SET_GYRO_XOUT_L0 (0X02 << ICM20689_CONFIG_SHIFT_EXT_SYNC_SET)
#define ICM20689_CONFIG_EXT_SYNC_SET_GYRO_YOUT_L0 (0X03 << ICM20689_CONFIG_SHIFT_EXT_SYNC_SET)
#define ICM20689_CONFIG_EXT_SYNC_SET_GYRO_ZOUT_L0 (0X04 << ICM20689_CONFIG_SHIFT_EXT_SYNC_SET)
#define ICM20689_CONFIG_EXT_SYNC_SET_ACCEL_XOUT_L0 (0X05 << ICM20689_CONFIG_SHIFT_EXT_SYNC_SET)
#define ICM20689_CONFIG_EXT_SYNC_SET_ACCEL_YOUT_L0 (0X06 << ICM20689_CONFIG_SHIFT_EXT_SYNC_SET)
#define ICM20689_CONFIG_EXT_SYNC_SET_ACCEL_ZOUT_L0 (0X07 << ICM20689_CONFIG_SHIFT_EXT_SYNC_SET)

/* GYRO_CONFIG bit fields*/
#define ICM20689_REG_GYRO_CONFIG (0X1B)

#define ICM20689_GYRO_CONFIG_SHIFT_FCHOICE_B (0X00)
#define ICM20689_GYRO_CONFIG_SHIFT_FS_SEL (0X03)
#define ICM20689_GYRO_CONFIG_SHIFT_ZG_ST (0X05)
#define ICM20689_GYRO_CONFIG_SHIFT_YG_ST (0X06)
#define ICM20689_GYRO_CONFIG_SHIFT_XG_ST (0X07)

#define ICM20689_GYRO_CONFIG_MASK_FCHOICE_B (0X03)
#define ICM20689_GYRO_CONFIG_MASK_FS_SEL (0X18)
#define ICM20689_GYRO_CONFIG_MASK_ZG_ST (0X20)
#define ICM20689_GYRO_CONFIG_MASK_YG_ST (0X40)
#define ICM20689_GYRO_CONFIG_MASK_XG_ST (0X80)

#define ICM20689_GYRO_CONFIG_BIT_ZG_ST (0X20)
#define ICM20689_GYRO_CONFIG_BIT_YG_ST (0X40)
#define ICM20689_GYRO_CONFIG_BIT_XG_ST (0X80)

#define _ICM20689_GYRO_CONFIG_FCHOICE_B_LOWPASS (0X00)
#define _ICM20689_GYRO_CONFIG_FCHOICE_B_8173HZ (0X01)
#define _ICM20689_GYRO_CONFIG_FCHOICE_B_3281HZ (0X02)
#define ICM20689_GYRO_CONFIG_FCHOICE_B_LOWPASS (0X00 << ICM20689_GYRO_CONFIG_SHIFT_FCHOICE_B)
#define ICM20689_GYRO_CONFIG_FCHOICE_B_8173HZ (0X01 << ICM20689_GYRO_CONFIG_SHIFT_FCHOICE_B)
#define ICM20689_GYRO_CONFIG_FCHOICE_B_3281HZ (0X02 << ICM20689_GYRO_CONFIG_SHIFT_FCHOICE_B)

#define _ICM20689_GYRO_CONFIG_FS_SEL_250_DPS (0X00)
#define _ICM20689_GYRO_CONFIG_FS_SEL_500_DPS (0X01)
#define _ICM20689_GYRO_CONFIG_FS_SEL_1000_DPS (0X02)
#define _ICM20689_GYRO_CONFIG_FS_SEL_2000_DPS (0X03)
#define ICM20689_GYRO_CONFIG_FS_SEL_250_DPS (0X00 << ICM20689_GYRO_CONFIG_SHIFT_FS_SEL)
#define ICM20689_GYRO_CONFIG_FS_SEL_500_DPS (0X01 << ICM20689_GYRO_CONFIG_SHIFT_FS_SEL)
#define ICM20689_GYRO_CONFIG_FS_SEL_1000_DPS (0X02 << ICM20689_GYRO_CONFIG_SHIFT_FS_SEL)
#define ICM20689_GYRO_CONFIG_FS_SEL_2000_DPS (0X03 << ICM20689_GYRO_CONFIG_SHIFT_FS_SEL)

