espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/icm20689/inc/sl_icm20689_defs.h
/* ACCEL_CONFIG bit fields*/
#define ICM20689_REG_ACCEL_CONFIG (0X1C)

#define ICM20689_ACCEL_CONFIG_SHIFT_ACCEL_FS_SEL (0X03)
#define ICM20689_ACCEL_CONFIG_SHIFT_ZA_ST (0X05)
#define ICM20689_ACCEL_CONFIG_SHIFT_YA_ST (0X06)
#define ICM20689_ACCEL_CONFIG_SHIFT_XA_ST (0X07)

#define ICM20689_ACCEL_CONFIG_MASK_ACCEL_FS_SEL (0X18)
#define ICM20689_ACCEL_CONFIG_MASK_ZA_ST (0X20)
#define ICM20689_ACCEL_CONFIG_MASK_YA_ST (0X40)
#define ICM20689_ACCEL_CONFIG_MASK_XA_ST (0X80)

#define ICM20689_ACCEL_CONFIG_BIT_ZA_ST (0X20)
#define ICM20689_ACCEL_CONFIG_BIT_YA_ST (0X40)
#define ICM20689_ACCEL_CONFIG_BIT_XA_ST (0X80)

#define _ICM20689_ACCEL_CONFIG_ACCEL_FS_SEL_2G (0X00)
#define _ICM20689_ACCEL_CONFIG_ACCEL_FS_SEL_4G (0X01)
#define _ICM20689_ACCEL_CONFIG_ACCEL_FS_SEL_8G (0X02)
#define _ICM20689_ACCEL_CONFIG_ACCEL_FS_SEL_16G (0X03)
#define ICM20689_ACCEL_CONFIG_ACCEL_FS_SEL_2G (0X00 << ICM20689_ACCEL_CONFIG_SHIFT_ACCEL_FS_SEL)
#define ICM20689_ACCEL_CONFIG_ACCEL_FS_SEL_4G (0X01 << ICM20689_ACCEL_CONFIG_SHIFT_ACCEL_FS_SEL)
#define ICM20689_ACCEL_CONFIG_ACCEL_FS_SEL_8G (0X02 << ICM20689_ACCEL_CONFIG_SHIFT_ACCEL_FS_SEL)
#define ICM20689_ACCEL_CONFIG_ACCEL_FS_SEL_16G (0X03 << ICM20689_ACCEL_CONFIG_SHIFT_ACCEL_FS_SEL)

/* ACCEL_CONFIG2 bit fields*/
#define ICM20689_REG_ACCEL_CONFIG2 (0X1D)

#define ICM20689_ACCEL_CONFIG2_SHIFT_A_DLPF_CFG (0X00)
#define ICM20689_ACCEL_CONFIG2_SHIFT_ACCEL_FCHOICE_B (0X03)
#define ICM20689_ACCEL_CONFIG2_SHIFT_DEC2_CFG (0X04)

#define ICM20689_ACCEL_CONFIG2_MASK_A_DLPF_CFG (0X07)
#define ICM20689_ACCEL_CONFIG2_MASK_ACCEL_FCHOICE_B (0X08)
#define ICM20689_ACCEL_CONFIG2_MASK_DEC2_CFG (0X30)

#define ICM20689_ACCEL_CONFIG2_BIT_ACCEL_FCHOICE_B (0X08)

#define _ICM20689_ACCEL_CONFIG2_A_DLPF_CFG_218_1_0HZ (0X00)
#define _ICM20689_ACCEL_CONFIG2_A_DLPF_CFG_218_1_1HZ (0X01)
#define _ICM20689_ACCEL_CONFIG2_A_DLPF_CFG_99HZ (0X02)
#define _ICM20689_ACCEL_CONFIG2_A_DLPF_CFG_44HZ (0X03)
#define _ICM20689_ACCEL_CONFIG2_A_DLPF_CFG_21_2HZ (0X04)
#define _ICM20689_ACCEL_CONFIG2_A_DLPF_CFG_10_2HZ (0X05)
#define _ICM20689_ACCEL_CONFIG2_A_DLPF_CFG_5_1HZ (0X06)
#define _ICM20689_ACCEL_CONFIG2_A_DLPF_CFG_420HZ (0X07)
#define ICM20689_ACCEL_CONFIG2_A_DLPF_CFG_218_1_0HZ (0X00 << ICM20689_ACCEL_CONFIG2_SHIFT_A_DLPF_CFG)
#define ICM20689_ACCEL_CONFIG2_A_DLPF_CFG_218_1_1HZ (0X01 << ICM20689_ACCEL_CONFIG2_SHIFT_A_DLPF_CFG)
#define ICM20689_ACCEL_CONFIG2_A_DLPF_CFG_99HZ (0X02 << ICM20689_ACCEL_CONFIG2_SHIFT_A_DLPF_CFG)
#define ICM20689_ACCEL_CONFIG2_A_DLPF_CFG_44HZ (0X03 << ICM20689_ACCEL_CONFIG2_SHIFT_A_DLPF_CFG)
#define ICM20689_ACCEL_CONFIG2_A_DLPF_CFG_21_2HZ (0X04 << ICM20689_ACCEL_CONFIG2_SHIFT_A_DLPF_CFG)
#define ICM20689_ACCEL_CONFIG2_A_DLPF_CFG_10_2HZ (0X05 << ICM20689_ACCEL_CONFIG2_SHIFT_A_DLPF_CFG)
#define ICM20689_ACCEL_CONFIG2_A_DLPF_CFG_5_1HZ (0X06 << ICM20689_ACCEL_CONFIG2_SHIFT_A_DLPF_CFG)
#define ICM20689_ACCEL_CONFIG2_A_DLPF_CFG_420HZ (0X07 << ICM20689_ACCEL_CONFIG2_SHIFT_A_DLPF_CFG)

#define _ICM20689_ACCEL_CONFIG2_DEC2_CFG_4_SMPL (0X00)
#define _ICM20689_ACCEL_CONFIG2_DEC2_CFG_8_SMPL (0X01)
#define _ICM20689_ACCEL_CONFIG2_DEC2_CFG_16_SMPL (0X02)
#define _ICM20689_ACCEL_CONFIG2_DEC2_CFG_32_SMPL (0X03)
#define ICM20689_ACCEL_CONFIG2_DEC2_CFG_4_SMPL (0X00 << ICM20689_ACCEL_CONFIG2_SHIFT_DEC2_CFG)
#define ICM20689_ACCEL_CONFIG2_DEC2_CFG_8_SMPL (0X01 << ICM20689_ACCEL_CONFIG2_SHIFT_DEC2_CFG)
#define ICM20689_ACCEL_CONFIG2_DEC2_CFG_16_SMPL (0X02 << ICM20689_ACCEL_CONFIG2_SHIFT_DEC2_CFG)
#define ICM20689_ACCEL_CONFIG2_DEC2_CFG_32_SMPL (0X03 << ICM20689_ACCEL_CONFIG2_SHIFT_DEC2_CFG)

/* LP_MODE_CFG bit fields*/
#define ICM20689_REG_LP_MODE_CFG (0X1E)

#define ICM20689_LP_MODE_CFG_SHIFT_G_AVGCFG (0X04)
#define ICM20689_LP_MODE_CFG_SHIFT_GYRO_CYCLE (0X07)

#define ICM20689_LP_MODE_CFG_MASK_G_AVGCFG (0X70)
#define ICM20689_LP_MODE_CFG_MASK_GYRO_CYCLE (0X80)

#define ICM20689_LP_MODE_CFG_BIT_GYRO_CYCLE (0X80)

#define _ICM20689_LP_MODE_CFG_G_AVGCFG_1X (0X00)
#define _ICM20689_LP_MODE_CFG_G_AVGCFG_2X (0X01)
#define _ICM20689_LP_MODE_CFG_G_AVGCFG_4X (0X02)
#define _ICM20689_LP_MODE_CFG_G_AVGCFG_8X (0X03)
#define _ICM20689_LP_MODE_CFG_G_AVGCFG_16X (0X04)
#define _ICM20689_LP_MODE_CFG_G_AVGCFG_32X (0X05)
#define _ICM20689_LP_MODE_CFG_G_AVGCFG_64X (0X06)
#define _ICM20689_LP_MODE_CFG_G_AVGCFG_128X (0X07)
#define ICM20689_LP_MODE_CFG_G_AVGCFG_1X (0X00 << ICM20689_LP_MODE_CFG_SHIFT_G_AVGCFG)
#define ICM20689_LP_MODE_CFG_G_AVGCFG_2X (0X01 << ICM20689_LP_MODE_CFG_SHIFT_G_AVGCFG)
#define ICM20689_LP_MODE_CFG_G_AVGCFG_4X (0X02 << ICM20689_LP_MODE_CFG_SHIFT_G_AVGCFG)
#define ICM20689_LP_MODE_CFG_G_AVGCFG_8X (0X03 << ICM20689_LP_MODE_CFG_SHIFT_G_AVGCFG)
#define ICM20689_LP_MODE_CFG_G_AVGCFG_16X (0X04 << ICM20689_LP_MODE_CFG_SHIFT_G_AVGCFG)
#define ICM20689_LP_MODE_CFG_G_AVGCFG_32X (0X05 << ICM20689_LP_MODE_CFG_SHIFT_G_AVGCFG)
#define ICM20689_LP_MODE_CFG_G_AVGCFG_64X (0X06 << ICM20689_LP_MODE_CFG_SHIFT_G_AVGCFG)
#define ICM20689_LP_MODE_CFG_G_AVGCFG_128X (0X07 << ICM20689_LP_MODE_CFG_SHIFT_G_AVGCFG)

/* ACCEL_WOM_THR bit fields*/
#define ICM20689_REG_ACCEL_WOM_THR (0X1F)

#define ICM20689_ACCEL_WOM_THR_SHIFT_WOM_THR (0X00)

#define ICM20689_ACCEL_WOM_THR_MASK_WOM_THR (0XFF)

/* FIFO_EN bit fields*/
#define ICM20689_REG_FIFO_EN (0X23)

#define ICM20689_FIFO_EN_SHIFT_ACCEL_FIFO_EN (0X03)
#define ICM20689_FIFO_EN_SHIFT_ZG_FIFO_EN (0X04)
#define ICM20689_FIFO_EN_SHIFT_YG_FIFO_EN (0X05)
#define ICM20689_FIFO_EN_SHIFT_XG_FIFO_EN (0X06)
#define ICM20689_FIFO_EN_SHIFT_TEMP_FIFO_EN (0X07)

#define ICM20689_FIFO_EN_MASK_ACCEL_FIFO_EN (0X08)
#define ICM20689_FIFO_EN_MASK_ZG_FIFO_EN (0X10)
#define ICM20689_FIFO_EN_MASK_YG_FIFO_EN (0X20)
#define ICM20689_FIFO_EN_MASK_XG_FIFO_EN (0X40)
#define ICM20689_FIFO_EN_MASK_TEMP_FIFO_EN (0X80)

#define ICM20689_FIFO_EN_BIT_ACCEL_FIFO_EN (0X08)
#define ICM20689_FIFO_EN_BIT_ZG_FIFO_EN (0X10)
#define ICM20689_FIFO_EN_BIT_YG_FIFO_EN (0X20)
#define ICM20689_FIFO_EN_BIT_XG_FIFO_EN (0X40)
#define ICM20689_FIFO_EN_BIT_TEMP_FIFO_EN (0X80)

/* FSYNC_INT bit fields*/
#define ICM20689_REG_FSYNC_INT (0X36)

#define ICM20689_FSYNC_INT_SHIFT_FSYNC_INT (0X07)

