espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/icm20689/inc/sl_icm20689_defs.h
#define ICM20689_FSYNC_INT_MASK_FSYNC_INT (0X80)

#define ICM20689_FSYNC_INT_BIT_FSYNC_INT (0X80)

/* INT_PIN_CFG bit fields*/
#define ICM20689_REG_INT_PIN_CFG (0X37)

#define ICM20689_INT_PIN_CFG_SHIFT_FSYNC_INT_MODE_EN (0X02)
#define ICM20689_INT_PIN_CFG_SHIFT_FSYNC_INT_LEVEL (0X03)
#define ICM20689_INT_PIN_CFG_SHIFT_INT_RD_CLEAR (0X04)
#define ICM20689_INT_PIN_CFG_SHIFT_LATCH_INT_EN (0X05)
#define ICM20689_INT_PIN_CFG_SHIFT_INT_OPEN (0X06)
#define ICM20689_INT_PIN_CFG_SHIFT_INT_LEVEL (0X07)

#define ICM20689_INT_PIN_CFG_MASK_FSYNC_INT_MODE_EN (0X04)
#define ICM20689_INT_PIN_CFG_MASK_FSYNC_INT_LEVEL (0X08)
#define ICM20689_INT_PIN_CFG_MASK_INT_RD_CLEAR (0X10)
#define ICM20689_INT_PIN_CFG_MASK_LATCH_INT_EN (0X20)
#define ICM20689_INT_PIN_CFG_MASK_INT_OPEN (0X40)
#define ICM20689_INT_PIN_CFG_MASK_INT_LEVEL (0X80)

#define ICM20689_INT_PIN_CFG_BIT_FSYNC_INT_MODE_EN (0X04)
#define ICM20689_INT_PIN_CFG_BIT_FSYNC_INT_LEVEL (0X08)
#define ICM20689_INT_PIN_CFG_BIT_INT_RD_CLEAR (0X10)
#define ICM20689_INT_PIN_CFG_BIT_LATCH_INT_EN (0X20)
#define ICM20689_INT_PIN_CFG_BIT_INT_OPEN (0X40)
#define ICM20689_INT_PIN_CFG_BIT_INT_LEVEL (0X80)

/* INT_ENABLE bit fields*/
#define ICM20689_REG_INT_ENABLE (0X38)

#define ICM20689_INT_ENABLE_SHIFT_DATA_RDY_INT_EN (0X00)
#define ICM20689_INT_ENABLE_SHIFT_DMP_INT_EN (0X01)
#define ICM20689_INT_ENABLE_SHIFT_GDRIVE_INT_EN (0X02)
#define ICM20689_INT_ENABLE_SHIFT_FIFO_OFLOW_EN (0X04)
#define ICM20689_INT_ENABLE_SHIFT_WOM_INT_EN (0X05)

#define ICM20689_INT_ENABLE_MASK_DATA_RDY_INT_EN (0X01)
#define ICM20689_INT_ENABLE_MASK_DMP_INT_EN (0X02)
#define ICM20689_INT_ENABLE_MASK_GDRIVE_INT_EN (0X04)
#define ICM20689_INT_ENABLE_MASK_FIFO_OFLOW_EN (0X10)
#define ICM20689_INT_ENABLE_MASK_WOM_INT_EN (0XE0)

#define ICM20689_INT_ENABLE_BIT_DATA_RDY_INT_EN (0X01)
#define ICM20689_INT_ENABLE_BIT_DMP_INT_EN (0X02)
#define ICM20689_INT_ENABLE_BIT_GDRIVE_INT_EN (0X04)
#define ICM20689_INT_ENABLE_BIT_FIFO_OFLOW_EN (0X10)

/* DMP_INT_STATUS bit fields*/
#define ICM20689_REG_DMP_INT_STATUS (0X39)

#define ICM20689_DMP_INT_STATUS_SHIFT_DMP_INT (0X00)

#define ICM20689_DMP_INT_STATUS_MASK_DMP_INT (0X3F)

/* INT_STATUS bit fields*/
#define ICM20689_REG_INT_STATUS (0X3A)

#define ICM20689_INT_STATUS_SHIFT_DATA_RDY_INT (0X00)
#define ICM20689_INT_STATUS_SHIFT_DMP_INT (0X01)
#define ICM20689_INT_STATUS_SHIFT_GDRIVE_INT (0X02)
#define ICM20689_INT_STATUS_SHIFT_FIFO_OFLOW_INT (0X04)
#define ICM20689_INT_STATUS_SHIFT_WOM_INT (0X05)

#define ICM20689_INT_STATUS_MASK_DATA_RDY_INT (0X01)
#define ICM20689_INT_STATUS_MASK_DMP_INT (0X02)
#define ICM20689_INT_STATUS_MASK_GDRIVE_INT (0X04)
#define ICM20689_INT_STATUS_MASK_FIFO_OFLOW_INT (0X10)
#define ICM20689_INT_STATUS_MASK_WOM_INT (0XE0)

#define ICM20689_INT_STATUS_BIT_DATA_RDY_INT (0X01)
#define ICM20689_INT_STATUS_BIT_DMP_INT (0X02)
#define ICM20689_INT_STATUS_BIT_GDRIVE_INT (0X04)
#define ICM20689_INT_STATUS_BIT_FIFO_OFLOW_INT (0X10)

/* ACCEL_XOUT_H bit fields*/
#define ICM20689_REG_ACCEL_XOUT_H (0X3B)

#define ICM20689_ACCEL_XOUT_H_SHIFT_ACCEL_XOUT_H (0X00)

#define ICM20689_ACCEL_XOUT_H_MASK_ACCEL_XOUT_H (0XFF)

/* ACCEL_XOUT_L bit fields*/
#define ICM20689_REG_ACCEL_XOUT_L (0X3C)

#define ICM20689_ACCEL_XOUT_L_SHIFT_ACCEL_XOUT_L (0X00)

#define ICM20689_ACCEL_XOUT_L_MASK_ACCEL_XOUT_L (0XFF)

/* ACCEL_YOUT_H bit fields*/
#define ICM20689_REG_ACCEL_YOUT_H (0X3D)

#define ICM20689_ACCEL_YOUT_H_SHIFT_ACCEL_YOUT_H (0X00)

#define ICM20689_ACCEL_YOUT_H_MASK_ACCEL_YOUT_H (0XFF)

/* ACCEL_YOUT_L bit fields*/
#define ICM20689_REG_ACCEL_YOUT_L (0X3E)

#define ICM20689_ACCEL_YOUT_L_SHIFT_ACCEL_YOUT_L (0X00)

#define ICM20689_ACCEL_YOUT_L_MASK_ACCEL_YOUT_L (0XFF)

/* ACCEL_ZOUT_H bit fields*/
#define ICM20689_REG_ACCEL_ZOUT_H (0X3F)

#define ICM20689_ACCEL_ZOUT_H_SHIFT_ACCEL_ZOUT_H (0X00)

#define ICM20689_ACCEL_ZOUT_H_MASK_ACCEL_ZOUT_H (0XFF)

/* ACCEL_ZOUT_L bit fields*/
#define ICM20689_REG_ACCEL_ZOUT_L (0X40)

#define ICM20689_ACCEL_ZOUT_L_SHIFT_ACCEL_ZOUT_L (0X00)

#define ICM20689_ACCEL_ZOUT_L_MASK_ACCEL_ZOUT_L (0XFF)

/* TEMP_OUT_H bit fields*/
#define ICM20689_REG_TEMP_OUT_H (0X41)

#define ICM20689_TEMP_OUT_H_SHIFT_TEMP_OUT (0X00)

#define ICM20689_TEMP_OUT_H_MASK_TEMP_OUT (0XFF)

/* TEMP_OUT_L bit fields*/
#define ICM20689_REG_TEMP_OUT_L (0X42)

#define ICM20689_TEMP_OUT_L_SHIFT_TEMP_OUT (0X00)

#define ICM20689_TEMP_OUT_L_MASK_TEMP_OUT (0XFF)

/* GYRO_XOUT_H bit fields*/
#define ICM20689_REG_GYRO_XOUT_H (0X43)

#define ICM20689_GYRO_XOUT_H_SHIFT_GYRO_XOUT (0X00)

#define ICM20689_GYRO_XOUT_H_MASK_GYRO_XOUT (0XFF)

/* GYRO_XOUT_L bit fields*/
#define ICM20689_REG_GYRO_XOUT_L (0X44)

#define ICM20689_GYRO_XOUT_L_SHIFT_GYRO_XOUT (0X00)

#define ICM20689_GYRO_XOUT_L_MASK_GYRO_XOUT (0XFF)

/* GYRO_YOUT_H bit fields*/
#define ICM20689_REG_GYRO_YOUT_H (0X45)

#define ICM20689_GYRO_YOUT_H_SHIFT_GYRO_YOUT (0X00)

#define ICM20689_GYRO_YOUT_H_MASK_GYRO_YOUT (0XFF)

/* GYRO_YOUT_L bit fields*/
#define ICM20689_REG_GYRO_YOUT_L (0X46)

#define ICM20689_GYRO_YOUT_L_SHIFT_GYRO_YOUT (0X00)

#define ICM20689_GYRO_YOUT_L_MASK_GYRO_YOUT (0XFF)

/* GYRO_ZOUT_H bit fields*/
#define ICM20689_REG_GYRO_ZOUT_H (0X47)

#define ICM20689_GYRO_ZOUT_H_SHIFT_GYRO_ZOUT (0X00)

#define ICM20689_GYRO_ZOUT_H_MASK_GYRO_ZOUT (0XFF)

/* GYRO_ZOUT_L bit fields*/
#define ICM20689_REG_GYRO_ZOUT_L (0X48)

#define ICM20689_GYRO_ZOUT_L_SHIFT_GYRO_ZOUT (0X00)

#define ICM20689_GYRO_ZOUT_L_MASK_GYRO_ZOUT (0XFF)

/* SIGNAL_PATH_RESET bit fields*/
#define ICM20689_REG_SIGNAL_PATH_RESET (0X68)

#define ICM20689_SIGNAL_PATH_RESET_SHIFT_TEMP_RST (0X00)
#define ICM20689_SIGNAL_PATH_RESET_SHIFT_ACCEL_RST (0X01)

#define ICM20689_SIGNAL_PATH_RESET_MASK_TEMP_RST (0X01)
#define ICM20689_SIGNAL_PATH_RESET_MASK_ACCEL_RST (0X02)

#define ICM20689_SIGNAL_PATH_RESET_BIT_TEMP_RST (0X01)
#define ICM20689_SIGNAL_PATH_RESET_BIT_ACCEL_RST (0X02)

/* ACCEL_INTEL_CTRL bit fields*/
#define ICM20689_REG_ACCEL_INTEL_CTRL (0X69)

#define ICM20689_ACCEL_INTEL_CTRL_SHIFT_ACCEL_INTEL_MODE (0X06)
#define ICM20689_ACCEL_INTEL_CTRL_SHIFT_ACCEL_INTEL_EN (0X07)

#define ICM20689_ACCEL_INTEL_CTRL_MASK_ACCEL_INTEL_MODE (0X40)
#define ICM20689_ACCEL_INTEL_CTRL_MASK_ACCEL_INTEL_EN (0X80)

#define ICM20689_ACCEL_INTEL_CTRL_BIT_ACCEL_INTEL_MODE (0X40)
#define ICM20689_ACCEL_INTEL_CTRL_BIT_ACCEL_INTEL_EN (0X80)

