espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/icm20689/inc/sl_icm20689_defs.h
/* USER_CTRL bit fields*/
#define ICM20689_REG_USER_CTRL (0X6A)

#define ICM20689_USER_CTRL_SHIFT_SIG_COND_RST (0X00)
#define ICM20689_USER_CTRL_SHIFT_FIFO_RST (0X02)
#define ICM20689_USER_CTRL_SHIFT_DMP_RST (0X03)
#define ICM20689_USER_CTRL_SHIFT_I2C_IF_DIS (0X04)
#define ICM20689_USER_CTRL_SHIFT_FIFO_EN (0X06)
#define ICM20689_USER_CTRL_SHIFT_DMP_EN (0X07)

#define ICM20689_USER_CTRL_MASK_SIG_COND_RST (0X01)
#define ICM20689_USER_CTRL_MASK_FIFO_RST (0X04)
#define ICM20689_USER_CTRL_MASK_DMP_RST (0X08)
#define ICM20689_USER_CTRL_MASK_I2C_IF_DIS (0X10)
#define ICM20689_USER_CTRL_MASK_FIFO_EN (0X40)
#define ICM20689_USER_CTRL_MASK_DMP_EN (0X80)

#define ICM20689_USER_CTRL_BIT_SIG_COND_RST (0X01)
#define ICM20689_USER_CTRL_BIT_FIFO_RST (0X04)
#define ICM20689_USER_CTRL_BIT_DMP_RST (0X08)
#define ICM20689_USER_CTRL_BIT_I2C_IF_DIS (0X10)
#define ICM20689_USER_CTRL_BIT_FIFO_EN (0X40)
#define ICM20689_USER_CTRL_BIT_DMP_EN (0X80)

/* PWR_MGMT_1 bit fields*/
#define ICM20689_REG_PWR_MGMT_1 (0X6B)

#define ICM20689_PWR_MGMT_1_SHIFT_CLKSEL (0X00)
#define ICM20689_PWR_MGMT_1_SHIFT_TEMP_DIS (0X03)
#define ICM20689_PWR_MGMT_1_SHIFT_GYRO_STANDBY (0X04)
#define ICM20689_PWR_MGMT_1_SHIFT_ACCEL_CYCLE (0X05)
#define ICM20689_PWR_MGMT_1_SHIFT_SLEEP (0X06)
#define ICM20689_PWR_MGMT_1_SHIFT_DEVICE_RESET (0X07)

#define ICM20689_PWR_MGMT_1_MASK_CLKSEL (0X07)
#define ICM20689_PWR_MGMT_1_MASK_TEMP_DIS (0X08)
#define ICM20689_PWR_MGMT_1_MASK_GYRO_STANDBY (0X10)
#define ICM20689_PWR_MGMT_1_MASK_ACCEL_CYCLE (0X20)
#define ICM20689_PWR_MGMT_1_MASK_SLEEP (0X40)
#define ICM20689_PWR_MGMT_1_MASK_DEVICE_RESET (0X80)

#define ICM20689_PWR_MGMT_1_BIT_TEMP_DIS (0X08)
#define ICM20689_PWR_MGMT_1_BIT_GYRO_STANDBY (0X10)
#define ICM20689_PWR_MGMT_1_BIT_ACCEL_CYCLE (0X20)
#define ICM20689_PWR_MGMT_1_BIT_SLEEP (0X40)
#define ICM20689_PWR_MGMT_1_BIT_DEVICE_RESET (0X80)

#define _ICM20689_PWR_MGMT_1_CLKSEL_INTERNAL_OSC_0 (0X00)
#define _ICM20689_PWR_MGMT_1_CLKSEL_AUTOSEL_0 (0X01)
#define _ICM20689_PWR_MGMT_1_CLKSEL_AUTOSEL_1 (0X02)
#define _ICM20689_PWR_MGMT_1_CLKSEL_AUTOSEL_2 (0X03)
#define _ICM20689_PWR_MGMT_1_CLKSEL_AUTOSEL_3 (0X04)
#define _ICM20689_PWR_MGMT_1_CLKSEL_AUTOSEL_4 (0X05)
#define _ICM20689_PWR_MGMT_1_CLKSEL_INTERNAL_OSC_1 (0X06)
#define _ICM20689_PWR_MGMT_1_CLKSEL_STOPPED (0X07)
#define ICM20689_PWR_MGMT_1_CLKSEL_INTERNAL_OSC_0 (0X00 << ICM20689_PWR_MGMT_1_SHIFT_CLKSEL)
#define ICM20689_PWR_MGMT_1_CLKSEL_AUTOSEL_0 (0X01 << ICM20689_PWR_MGMT_1_SHIFT_CLKSEL)
#define ICM20689_PWR_MGMT_1_CLKSEL_AUTOSEL_1 (0X02 << ICM20689_PWR_MGMT_1_SHIFT_CLKSEL)
#define ICM20689_PWR_MGMT_1_CLKSEL_AUTOSEL_2 (0X03 << ICM20689_PWR_MGMT_1_SHIFT_CLKSEL)
#define ICM20689_PWR_MGMT_1_CLKSEL_AUTOSEL_3 (0X04 << ICM20689_PWR_MGMT_1_SHIFT_CLKSEL)
#define ICM20689_PWR_MGMT_1_CLKSEL_AUTOSEL_4 (0X05 << ICM20689_PWR_MGMT_1_SHIFT_CLKSEL)
#define ICM20689_PWR_MGMT_1_CLKSEL_INTERNAL_OSC_1 (0X06 << ICM20689_PWR_MGMT_1_SHIFT_CLKSEL)
#define ICM20689_PWR_MGMT_1_CLKSEL_STOPPED (0X07 << ICM20689_PWR_MGMT_1_SHIFT_CLKSEL)

/* PWR_MGMT_2 bit fields*/
#define ICM20689_REG_PWR_MGMT_2 (0X6C)

#define ICM20689_PWR_MGMT_2_SHIFT_STBY_ZG (0X00)
#define ICM20689_PWR_MGMT_2_SHIFT_STBY_YG (0X01)
#define ICM20689_PWR_MGMT_2_SHIFT_STBY_XG (0X02)
#define ICM20689_PWR_MGMT_2_SHIFT_STBY_ZA (0X03)
#define ICM20689_PWR_MGMT_2_SHIFT_STBY_YA (0X04)
#define ICM20689_PWR_MGMT_2_SHIFT_STBY_XA (0X05)
#define ICM20689_PWR_MGMT_2_SHIFT_DMP_LP_DIS (0X06)
#define ICM20689_PWR_MGMT_2_SHIFT_FIFO_LP_EN (0X07)

#define ICM20689_PWR_MGMT_2_MASK_STBY_ZG (0X01)
#define ICM20689_PWR_MGMT_2_MASK_STBY_YG (0X02)
#define ICM20689_PWR_MGMT_2_MASK_STBY_XG (0X04)
#define ICM20689_PWR_MGMT_2_MASK_STBY_ZA (0X08)
#define ICM20689_PWR_MGMT_2_MASK_STBY_YA (0X10)
#define ICM20689_PWR_MGMT_2_MASK_STBY_XA (0X20)
#define ICM20689_PWR_MGMT_2_MASK_DMP_LP_DIS (0X40)
#define ICM20689_PWR_MGMT_2_MASK_FIFO_LP_EN (0X80)

#define ICM20689_PWR_MGMT_2_BIT_STBY_ZG (0X01)
#define ICM20689_PWR_MGMT_2_BIT_STBY_YG (0X02)
#define ICM20689_PWR_MGMT_2_BIT_STBY_XG (0X04)
#define ICM20689_PWR_MGMT_2_BIT_STBY_ZA (0X08)
#define ICM20689_PWR_MGMT_2_BIT_STBY_YA (0X10)
#define ICM20689_PWR_MGMT_2_BIT_STBY_XA (0X20)
#define ICM20689_PWR_MGMT_2_BIT_DMP_LP_DIS (0X40)
#define ICM20689_PWR_MGMT_2_BIT_FIFO_LP_EN (0X80)

/* FIFO_COUNTH bit fields*/
#define ICM20689_REG_FIFO_COUNTH (0X72)

#define ICM20689_FIFO_COUNTH_SHIFT_FIFO_COUNT (0X00)

#define ICM20689_FIFO_COUNTH_MASK_FIFO_COUNT (0X1F)

/* FIFO_COUNTL bit fields*/
#define ICM20689_REG_FIFO_COUNTL (0X73)

#define ICM20689_FIFO_COUNTL_SHIFT_FIFO_COUNT (0X00)

#define ICM20689_FIFO_COUNTL_MASK_FIFO_COUNT (0XFF)

/* FIFO_R_W bit fields*/
#define ICM20689_REG_FIFO_R_W (0X74)

#define ICM20689_FIFO_R_W_SHIFT_FIFO_DATA (0X00)

#define ICM20689_FIFO_R_W_MASK_FIFO_DATA (0XFF)

/* WHO_AM_I bit fields*/
#define ICM20689_REG_WHO_AM_I (0X75)

#define ICM20689_WHO_AM_I_SHIFT_WHOAMI (0X00)

#define ICM20689_WHO_AM_I_MASK_WHOAMI (0XFF)

/* XA_OFFSET_H bit fields*/
#define ICM20689_REG_XA_OFFSET_H (0X77)

#define ICM20689_XA_OFFSET_H_SHIFT_WHOAMI (0X00)

#define ICM20689_XA_OFFSET_H_MASK_WHOAMI (0XFF)

/* XA_OFFSET_L bit fields*/
#define ICM20689_REG_XA_OFFSET_L (0X78)

#define ICM20689_XA_OFFSET_L_SHIFT_WHOAMI (0X00)

#define ICM20689_XA_OFFSET_L_MASK_WHOAMI (0XFF)

/* YA_OFFSET_H bit fields*/
#define ICM20689_REG_YA_OFFSET_H (0X7A)

#define ICM20689_YA_OFFSET_H_SHIFT_WHOAMI (0X00)

#define ICM20689_YA_OFFSET_H_MASK_WHOAMI (0XFF)

/* YA_OFFSET_L bit fields*/
#define ICM20689_REG_YA_OFFSET_L (0X7B)

#define ICM20689_YA_OFFSET_L_SHIFT_WHOAMI (0X00)

#define ICM20689_YA_OFFSET_L_MASK_WHOAMI (0XFF)

/* ZA_OFFSET_H bit fields*/
#define ICM20689_REG_ZA_OFFSET_H (0X7D)

#define ICM20689_ZA_OFFSET_H_SHIFT_WHOAMI (0X00)

#define ICM20689_ZA_OFFSET_H_MASK_WHOAMI (0XFF)

/* ZA_OFFSET_L bit fields*/
#define ICM20689_REG_ZA_OFFSET_L (0X7E)

#define ICM20689_ZA_OFFSET_L_SHIFT_WHOAMI (0X00)

#define ICM20689_ZA_OFFSET_L_MASK_WHOAMI (0XFF)

#ifdef __cplusplus
}
#endif

/** @endcond */
#endif // SL_ICM20689_DEFS_H
